app/controllers/movies_controller.rb

  def similar
    movie = Movie.find(params[:movie_id])
---
SELECT "movies".* FROM "movies" WHERE (id != '1' AND director = 'George Lucas')